import Control.Monad

str = "가각간갈감갑강개객갱갹거건걸검겁게격견결겸경계고곡곤골공곶과곽관괄광괘괴굉교구국군굴궁권궐궤귀규균귤극근글금급긍기긴길김끽나낙난날남납낭내냉녀년념녕노녹논농뇌뇨누눈눌뉴늑늠능니닉다단달담답당대댁덕도독돈돌동두둔득등라락란랄람랍랑래랭략량려력련렬렴렵령례로록론롱뢰료룡루류륙륜률륭륵름릉리린림립마막만말망매맥맹멱면멸명몌모목몰몽묘무묵문물미민밀박반발방배백번벌범법벽변별병보복본볼봉부북분불붕비빈빙사삭산살삼삽상새색생서석선설섬섭성세소속손솔송쇄쇠수숙순술숭슬습승시식신실심십쌍씨아악안알암압앙애액앵야약양어억언얼엄업엔여역연열염엽영예오옥온올옹와완왈왕왜외요욕용우욱운울웅원월위유육윤율융은을음읍응의이익인일임입잉자작잔잠잡장재쟁저적전절점접정제조족존졸종좌죄주죽준줄중즉즐즙증지직진질짐집징차착찬찰참창채책처척천철첨첩청체초촉촌총촬최추축춘출충췌취측층치칙친칠침칩칭쾌타탁탄탈탐탑탕태택탱터토통퇴투특틈파판팔패팽퍅편폄평폐포폭표품풍피필핍하학한할함합항해핵행향허헌헐험혁현혈혐협형혜호혹혼홀홍화확환활황회획횡효후훈훙훤훼휘휴휼흉흑흔흘흠흡흥희힐";

foo :: (a -> a -> b) -> [a] -> [b]
foo f [a,b] = [f a b]
foo f (a:b:xs) = f a b : foo f (b:xs)

main = do
 print $ all id (foo (<) str)